Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ТипыТестовыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТестовыхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдиночныйВыбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МножественныйВыбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сопоставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упорядочивание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытыйОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФрагментКода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ТестовыеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТестовыеЗадания</Name>
			<Comment>Банк тестовых заданий с параметрами IRT (b, a)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестовыхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстПредъявления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимыйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяПравильным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭталонныйОтвет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПрограммноеЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЛимитЗаданий = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ЛимитЗаданийВСессии");

	Если Объект.Ссылка.Пустая() И Объект.СтатусСессии = "" Тогда

		// Новая сессия — инициализация. Тема и Обучающийся уже должны быть заполнены
		// вызывающим кодом (либо РабочийСтолОбучающегося).
		Если Не ЗначениеЗаполнено(Объект.Обучающийся) Тогда
			Объект.Обучающийся = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь();
		КонецЕсли;

		Если Параметры.Свойство("ЗначенияЗаполнения")
			И Параметры.ЗначенияЗаполнения.Свойство("Тема") Тогда

			Объект.Тема = Параметры.ЗначенияЗаполнения.Тема;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.Тема) Тогда

			Результат = АдаптивноеТестирование.НачатьСессию(Объект.Обучающийся, Объект.Тема);

			Если ЗначениеЗаполнено(Результат.Ошибка) Тогда

				ВызватьИсключение Результат.Ошибка;
			КонецЕсли;

			ЗначениеВРеквизитФормы(Результат.Сессия.ПолучитьОбъект(), "Объект");

			Если ЗначениеЗаполнено(Результат.ПервоеЗадание) Тогда

				ЗагрузитьЗадание(Результат.ПервоеЗадание);
			КонецЕсли;
		Иначе

			// Форма открыта без темы (например, ручное создание документа) — сессия не
			// стартует. Поясняем пользователю и не даём отвечать «в пустоту».
			ФормулировкаЗадания = НСтр(
				"ru = 'Сессия не запущена: не выбрана тема. Откройте тест через «Рабочий стол обучающегося», нажав «Начать сессию» по рекомендованной теме.'");
		КонецЕсли;
	ИначеЕсли Объект.СтатусСессии = "Активна" Тогда

		ВосстановитьСостояние();
	КонецЕсли;

	ОбновитьПоказатели();
	ВремяНачалаЗадания = ТекущаяДатаСеанса();
	СформироватьHTML();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	// Программное закрытие (после завершения/прерывания) не должно повторно
	// спрашивать про прерывание — иначе диалог зацикливается.
	Если ПрограммноеЗакрытие = Истина Тогда
		
		Возврат;
	КонецЕсли;

	Если Объект.СтатусСессии = "Активна" Тогда
		
		Отказ = Истина;
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			НСтр("ru = 'Сессия не завершена. Прервать?'"),
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПрерватьСессиюНаСервере();
		ПрограммноеЗакрытие = Истина;
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	// Нажатия внутри HTML приходят сюда. Действия закодированы в href ссылок-кнопок:
	//  cmd:answer:<ид1,ид2>  — ответить выбранными вариантами,
	//  cmd:skip              — пропустить, cmd:abort — прервать.
	// Клики по самим вариантам (radio/checkbox) приходят без Href — их игнорируем.
	Если ДанныеСобытия = Неопределено ИЛИ ДанныеСобытия.Href = Неопределено Тогда
		
		Возврат;
	КонецЕсли;

	URLНРег = НРег(ДанныеСобытия.Href);

	Если Найти(URLНРег, "abort") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПрерватьСессиюЗапрос();
	ИначеЕсли Найти(URLНРег, "skip") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ОбработатьОтветКлиент(Новый Массив, Истина);
	ИначеЕсли Найти(URLНРег, "answer") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбранныеИд = ИзвлечьВыбор(ДанныеСобытия.Href);
		
		Если ВыбранныеИд.Количество() = 0 Тогда
			
			ПоказатьСообщениеПользователю(НСтр("ru = 'Выберите вариант ответа.'"));
			Возврат;
		КонецЕсли;
		
		ОбработатьОтветКлиент(ВыбранныеИд, Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиент

&НаКлиенте
Процедура ОбработатьОтветКлиент(ВыбранныеИд, Пропущено)

	Результат = ОтветитьНаСервере(ВремяОткликаЗадания(), ВыбранныеИд, Пропущено);

	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		
		ПоказатьСообщениеПользователю(Результат.Ошибка);
		Возврат;
	КонецЕсли;

	Если Результат.ЗавершитьСессию Тогда
		
		ПрограммноеЗакрытие = Истина;
		Модифицированность = Ложь;
		Текст = СтрШаблон(
			НСтр("ru = 'Сессия завершена. Итоговая θ = %1, SE = %2'"),
			Формат(Результат.ТекущаяТета, "ЧДЦ=2; ЧРД=."),
			Формат(Результат.ТекущаяSE, "ЧДЦ=2; ЧРД=."));
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПослеЗавершенияСессии", ЭтотОбъект), Текст);
	Иначе
		
		ВремяНачалаЗадания = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияСессии(ДополнительныеПараметры) Экспорт

	// Показать отчет по прохождению (кривая сходимости θ) для только что
	// завершенной попытки, затем закрыть форму теста.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ОткрытьФорму("Отчет.ОтчётПоПрохождениюТеста.Форма.ФормаОтчёта",
			Новый Структура("Сессия", Объект.Ссылка));
	КонецЕсли;

	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьСессиюЗапрос()

	ПоказатьВопрос(
		Новый ОписаниеОповещения("ПрерватьВыполнитьЗавершение", ЭтотОбъект),
		НСтр("ru = 'Прервать сессию досрочно? Промежуточные результаты будут сохранены.'"),
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПрерватьСессиюНаСервере();
		ПрограммноеЗакрытие = Истина;
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ИзвлечьВыбор(URL)

	// Достаём номера выбранных вариантов из строки вида "cmd:answer:1,3"
	// (разделители любые не-цифры; устойчиво к URL-кодированию запятой).
	Результат = Новый Массив;
	Позиция = Найти(НРег(URL), "answer");
	
	Если Позиция = 0 Тогда
		
		Возврат Результат;
	КонецЕсли;

	Хвост = Сред(URL, Позиция + 6);
	Текущее = "";
	
	Для Сч = 1 По СтрДлина(Хвост) Цикл
		
		Симв = Сред(Хвост, Сч, 1);
		
		Если Симв >= "0" И Симв <= "9" Тогда
			
			Текущее = Текущее + Симв;
		ИначеЕсли Не ПустаяСтрока(Текущее) Тогда
			
			Результат.Добавить(Число(Текущее));
			Текущее = "";
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(Текущее) Тогда
		
		Результат.Добавить(Число(Текущее));
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ВремяОткликаЗадания()

	Если ЗначениеЗаполнено(ВремяНачалаЗадания) Тогда
		
		Возврат ТекущаяДата() - ВремяНачалаЗадания;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеПользователю(Знач Текст)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервер

&НаСервере
Функция ОтветитьНаСервере(ВремяОтклика, ВыбранныеИд, Пропущено = Ложь)

	Если Объект.Ссылка.Пустая() Тогда
		
		Возврат Новый Структура("Ошибка, ЗавершитьСессию, ТекущаяТета, ТекущаяSE",
			НСтр("ru = 'Сессия не запущена. Откройте тест через «Рабочий стол обучающегося» по рекомендованной теме.'"),
			Ложь, 0, 99);
	КонецЕсли;

	Верно = Ложь;
	
	Если Не Пропущено Тогда
		
		Верно = ПроверитьОтветПоВариантам(ТекущееЗадание, ВыбранныеИд);
	КонецЕсли;

	ТекстОтвета = СтрСоединить(ВыбранныеИд, ",");
	ПервыйИд    = ?(ВыбранныеИд.Количество() > 0, ВыбранныеИд[0], 0);

	Результат = АдаптивноеТестирование.ОбработатьОтвет(
		Объект.Ссылка, ТекущееЗадание, ПервыйИд, ТекстОтвета, ВремяОтклика, Верно);

	ТекущаяТета = Результат.ТекущаяТета;
	ТекущаяSE   = Результат.ТекущаяSE;

	Если Не Результат.ЗавершитьСессию И ЗначениеЗаполнено(Результат.СледующееЗадание) Тогда
		
		ЗагрузитьЗадание(Результат.СледующееЗадание);
		НомерЗадания = НомерЗадания + 1;
	КонецЕсли;

	СформироватьHTML();
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьОтветПоВариантам(ЗаданиеСсылка, ВыбранныеИд)

	// Верно, если множество выбранных вариантов (НомерСтроки) в точности совпадает
	// с множеством правильных. Флаг правильности клиенту не передаётся — сверка тут.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ВариантыОтвета.НомерСтроки КАК Ид
	|ИЗ
	|   Справочник.ТестовыеЗадания.ВариантыОтвета КАК ВариантыОтвета
	|ГДЕ
	|   ВариантыОтвета.Ссылка = &Задание
	|   И ВариантыОтвета.ЯвляетсяПравильным";
	Запрос.УстановитьПараметр("Задание", ЗаданиеСсылка);

	Правильные = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Правильные.Вставить(Число(Выборка.Ид), Истина);
	КонецЦикла;

	Если Правильные.Количество() = 0 Тогда
		
		Возврат Ложь;
	КонецЕсли;

	Если ВыбранныеИд.Количество() <> Правильные.Количество() Тогда
		
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Ид Из ВыбранныеИд Цикл
		
		Если Правильные.Получить(Число(Ид)) = Неопределено Тогда
			
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ПрерватьСессиюНаСервере()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сессия = Объект.Ссылка.ПолучитьОбъект();
		Сессия.СтатусСессии = "Прервана";
		Сессия.ДатаОкончания = ТекущаяДатаСеанса();
		Сессия.Записать();
		// Синхронизируем локальную копию, чтобы ПередЗакрытием не сработал повторно.
		Объект.СтатусСессии = "Прервана";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗадание(ЗаданиеСсылка)

	ТекущееЗадание = ЗаданиеСсылка;
	
	ФормулировкаЗадания = ОбщегоНазначенияСерверПриложение.ЗначениеРеквизитаОбъекта(
		ЗаданиеСсылка, "Формулировка");
		
	ТипЗадания = ОбщегоНазначенияСерверПриложение.ЗначениеРеквизитаОбъекта(
		ЗаданиеСсылка, "ТипЗадания");
		
	МножественныйВыбор = (ТипЗадания = Перечисления.ТипыТестовыхЗаданий.МножественныйВыбор);

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказатели()

	ЛимитЗаданий = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ЛимитЗаданийВСессии");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		НомерЗадания = Объект.Ответы.Количество() + 1;
		
		Если Объект.Ответы.Количество() > 0 Тогда
			
			Последний = Объект.Ответы[Объект.Ответы.Количество() - 1];
			ТекущаяТета = Последний.ТекущаяОценкаТета;
			ТекущаяSE   = Последний.ТекущаяSE;
		КонецЕсли;
	Иначе
		
		НомерЗадания = 1;
		ТекущаяТета  = 0;
		ТекущаяSE    = 99;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВосстановитьСостояние()

	// Восстановить показатели последнего ответа и перевыбрать текущее задание
	// по актуальной θ (предыдущий выбор в форме не сохраняется между сеансами).
	Если Объект.Ответы.Количество() > 0 Тогда
		
		Последний = Объект.Ответы[Объект.Ответы.Количество() - 1];
		ТекущаяТета = Последний.ТекущаяОценкаТета;
		ТекущаяSE   = Последний.ТекущаяSE;
	КонецЕсли;

	СледующееЗадание = АдаптивноеТестирование.ПодобратьСледующееЗаданиеСессии(Объект.Ссылка);
	Если ЗначениеЗаполнено(СледующееЗадание) Тогда
		
		ЗагрузитьЗадание(СледующееЗадание);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьHTML()

	Данные = Новый Структура;
	Данные.Вставить("active",   Объект.СтатусСессии = "Активна");
	Данные.Вставить("num",      НомерЗадания);
	Данные.Вставить("limit",    ЛимитЗаданий);
	Данные.Вставить("theta",    Формат(ТекущаяТета, "ЧДЦ=2; ЧРД=."));
	Данные.Вставить("se",       Формат(ТекущаяSE, "ЧДЦ=2; ЧРД=."));
	Данные.Вставить("question", ФормулировкаЗадания);
	Данные.Вставить("multiple", МножественныйВыбор);
	Данные.Вставить("options",  ?(ЗначениеЗаполнено(ТекущееЗадание), ВариантыЗадания(ТекущееЗадание), Новый Массив));
	Данные.Вставить("labels",   МеткиИнтерфейса());

	Макет = Документы.ПопыткаТеста.ПолучитьМакет("HTMLШаблон");
	ТекстHTML = СтрЗаменить(Макет.ПолучитьТекст(), "{{TEST_DATA}}", СтруктураВJSON(Данные));

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВариантыЗадания(ЗаданиеСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ВариантыОтвета.НомерСтроки КАК Ид,
	|   ВариантыОтвета.Текст       КАК Текст
	|ИЗ
	|   Справочник.ТестовыеЗадания.ВариантыОтвета КАК ВариантыОтвета
	|ГДЕ
	|   ВариантыОтвета.Ссылка = &Задание
	|УПОРЯДОЧИТЬ ПО
	|   Ид";
	Запрос.УстановитьПараметр("Задание", ЗаданиеСсылка);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("id, text", Выборка.Ид, Выборка.Текст));
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция МеткиИнтерфейса()

	Метки = Новый Структура;
	Метки.Вставить("title",     НСтр("ru = 'Сессия адаптивного тестирования'"));
	Метки.Вставить("task",      НСтр("ru = 'Задание №'"));
	Метки.Вставить("of",        НСтр("ru = 'из'"));
	Метки.Вставить("theta",     НСтр("ru = 'Текущая оценка θ'"));
	Метки.Вставить("se",        НСтр("ru = 'Стандартная ошибка SE'"));
	Метки.Вставить("question",  НСтр("ru = 'Задание'"));
	Метки.Вставить("pickOne",   НСтр("ru = 'Выберите один вариант ответа'"));
	Метки.Вставить("pickMany",  НСтр("ru = 'Выберите один или несколько вариантов ответа'"));
	Метки.Вставить("noOptions", НСтр("ru = 'Для этого задания не заданы варианты ответа.'"));
	Метки.Вставить("answer",    НСтр("ru = 'Ответить'"));
	Метки.Вставить("skip",      НСтр("ru = 'Пропустить'"));
	Метки.Вставить("abort",     НСтр("ru = 'Прервать'"));
	Возврат Метки;

КонецФункции

&НаСервереБезКонтекста
Функция СтруктураВJSON(Знач Данные)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти
